; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph1 - mode
	infrared0 - mode
	spectrograph2 - mode
	image3 - mode
	Star2 - direction
	GroundStation0 - direction
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image3)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 158)
	(= (data Star3 spectrograph1) 6)
	(= (data Star4 spectrograph1) 42)
	(= (data Planet5 spectrograph1) 135)
	(= (data Star6 spectrograph1) 200)
	(= (data Phenomenon7 spectrograph1) 26)
	(= (data Star8 spectrograph1) 44)
	(= (data Phenomenon9 spectrograph1) 259)
	(= (data Planet10 spectrograph1) 94)
	(= (data Star3 infrared0) 254)
	(= (data Star4 infrared0) 215)
	(= (data Planet5 infrared0) 81)
	(= (data Star6 infrared0) 233)
	(= (data Phenomenon7 infrared0) 69)
	(= (data Star8 infrared0) 12)
	(= (data Phenomenon9 infrared0) 153)
	(= (data Planet10 infrared0) 23)
	(= (data Star3 spectrograph2) 152)
	(= (data Star4 spectrograph2) 176)
	(= (data Planet5 spectrograph2) 175)
	(= (data Star6 spectrograph2) 244)
	(= (data Phenomenon7 spectrograph2) 123)
	(= (data Star8 spectrograph2) 177)
	(= (data Phenomenon9 spectrograph2) 159)
	(= (data Planet10 spectrograph2) 244)
	(= (data Star3 image3) 32)
	(= (data Star4 image3) 275)
	(= (data Planet5 image3) 281)
	(= (data Star6 image3) 258)
	(= (data Phenomenon7 image3) 182)
	(= (data Star8 image3) 195)
	(= (data Phenomenon9 image3) 129)
	(= (data Planet10 image3) 176)
	(= (slew_time Star2 GroundStation0) 8.32)
	(= (slew_time GroundStation0 Star2) 8.32)
	(= (slew_time Star2 Star1) 4.712)
	(= (slew_time Star1 Star2) 4.712)
	(= (slew_time Star1 GroundStation0) 30.35)
	(= (slew_time GroundStation0 Star1) 30.35)
	(= (slew_time Star3 GroundStation0) 20.55)
	(= (slew_time GroundStation0 Star3) 20.55)
	(= (slew_time Star3 Star1) 6.594)
	(= (slew_time Star1 Star3) 6.594)
	(= (slew_time Star3 Star2) 7.982)
	(= (slew_time Star2 Star3) 7.982)
	(= (slew_time Star4 GroundStation0) 6.907)
	(= (slew_time GroundStation0 Star4) 6.907)
	(= (slew_time Star4 Star1) 45.3)
	(= (slew_time Star1 Star4) 45.3)
	(= (slew_time Star4 Star2) 0.6253)
	(= (slew_time Star2 Star4) 0.6253)
	(= (slew_time Star4 Star3) 3.552)
	(= (slew_time Star3 Star4) 3.552)
	(= (slew_time Planet5 GroundStation0) 4.583)
	(= (slew_time GroundStation0 Planet5) 4.583)
	(= (slew_time Planet5 Star1) 7.055)
	(= (slew_time Star1 Planet5) 7.055)
	(= (slew_time Planet5 Star2) 27.32)
	(= (slew_time Star2 Planet5) 27.32)
	(= (slew_time Planet5 Star3) 75.4)
	(= (slew_time Star3 Planet5) 75.4)
	(= (slew_time Planet5 Star4) 21.06)
	(= (slew_time Star4 Planet5) 21.06)
	(= (slew_time Star6 GroundStation0) 32.13)
	(= (slew_time GroundStation0 Star6) 32.13)
	(= (slew_time Star6 Star1) 6.411)
	(= (slew_time Star1 Star6) 6.411)
	(= (slew_time Star6 Star2) 35.81)
	(= (slew_time Star2 Star6) 35.81)
	(= (slew_time Star6 Star3) 30.42)
	(= (slew_time Star3 Star6) 30.42)
	(= (slew_time Star6 Star4) 58.1)
	(= (slew_time Star4 Star6) 58.1)
	(= (slew_time Star6 Planet5) 4.96)
	(= (slew_time Planet5 Star6) 4.96)
	(= (slew_time Phenomenon7 GroundStation0) 37.7)
	(= (slew_time GroundStation0 Phenomenon7) 37.7)
	(= (slew_time Phenomenon7 Star1) 63.59)
	(= (slew_time Star1 Phenomenon7) 63.59)
	(= (slew_time Phenomenon7 Star2) 20.03)
	(= (slew_time Star2 Phenomenon7) 20.03)
	(= (slew_time Phenomenon7 Star3) 9.928)
	(= (slew_time Star3 Phenomenon7) 9.928)
	(= (slew_time Phenomenon7 Star4) 29.8)
	(= (slew_time Star4 Phenomenon7) 29.8)
	(= (slew_time Phenomenon7 Planet5) 29.51)
	(= (slew_time Planet5 Phenomenon7) 29.51)
	(= (slew_time Phenomenon7 Star6) 61.51)
	(= (slew_time Star6 Phenomenon7) 61.51)
	(= (slew_time Star8 GroundStation0) 7.303)
	(= (slew_time GroundStation0 Star8) 7.303)
	(= (slew_time Star8 Star1) 8.976)
	(= (slew_time Star1 Star8) 8.976)
	(= (slew_time Star8 Star2) 7.96)
	(= (slew_time Star2 Star8) 7.96)
	(= (slew_time Star8 Star3) 8.796)
	(= (slew_time Star3 Star8) 8.796)
	(= (slew_time Star8 Star4) 44.83)
	(= (slew_time Star4 Star8) 44.83)
	(= (slew_time Star8 Planet5) 19.23)
	(= (slew_time Planet5 Star8) 19.23)
	(= (slew_time Star8 Star6) 67.26)
	(= (slew_time Star6 Star8) 67.26)
	(= (slew_time Star8 Phenomenon7) 37.99)
	(= (slew_time Phenomenon7 Star8) 37.99)
	(= (slew_time Phenomenon9 GroundStation0) 70.02)
	(= (slew_time GroundStation0 Phenomenon9) 70.02)
	(= (slew_time Phenomenon9 Star1) 43.91)
	(= (slew_time Star1 Phenomenon9) 43.91)
	(= (slew_time Phenomenon9 Star2) 70.83)
	(= (slew_time Star2 Phenomenon9) 70.83)
	(= (slew_time Phenomenon9 Star3) 53.65)
	(= (slew_time Star3 Phenomenon9) 53.65)
	(= (slew_time Phenomenon9 Star4) 22.35)
	(= (slew_time Star4 Phenomenon9) 22.35)
	(= (slew_time Phenomenon9 Planet5) 69.13)
	(= (slew_time Planet5 Phenomenon9) 69.13)
	(= (slew_time Phenomenon9 Star6) 82.4)
	(= (slew_time Star6 Phenomenon9) 82.4)
	(= (slew_time Phenomenon9 Phenomenon7) 33.37)
	(= (slew_time Phenomenon7 Phenomenon9) 33.37)
	(= (slew_time Phenomenon9 Star8) 10.76)
	(= (slew_time Star8 Phenomenon9) 10.76)
	(= (slew_time Planet10 GroundStation0) 4.114)
	(= (slew_time GroundStation0 Planet10) 4.114)
	(= (slew_time Planet10 Star1) 37.52)
	(= (slew_time Star1 Planet10) 37.52)
	(= (slew_time Planet10 Star2) 48.86)
	(= (slew_time Star2 Planet10) 48.86)
	(= (slew_time Planet10 Star3) 1.463)
	(= (slew_time Star3 Planet10) 1.463)
	(= (slew_time Planet10 Star4) 88.2)
	(= (slew_time Star4 Planet10) 88.2)
	(= (slew_time Planet10 Planet5) 19.58)
	(= (slew_time Planet5 Planet10) 19.58)
	(= (slew_time Planet10 Star6) 35.81)
	(= (slew_time Star6 Planet10) 35.81)
	(= (slew_time Planet10 Phenomenon7) 28.08)
	(= (slew_time Phenomenon7 Planet10) 28.08)
	(= (slew_time Planet10 Star8) 27.76)
	(= (slew_time Star8 Planet10) 27.76)
	(= (slew_time Planet10 Phenomenon9) 34.72)
	(= (slew_time Phenomenon9 Planet10) 34.72)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star3 image3)
	(have_image Star4 spectrograph1)
	(have_image Planet5 spectrograph2)
	(have_image Star6 spectrograph2)
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 image3)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 planet10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 158 to 120.48, (fuel-used) from 0 to 37.52
   goals met: 0 of 7
2. (turn_to satellite0 groundstation0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 120.48 to 116.366, (fuel-used) from 37.52 to 41.634
   goals met: 0 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 0 of 7
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
7. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 7
8. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 116.366 to 112.252, (fuel-used) from 41.634 to 45.748
   goals met: 0 of 7
9. (take_image satellite0 planet10 instrument1 image3)
   added: (have_image planet10 image3)
   changed: (data_capacity satellite0) from 1000 to 824, (data-stored) from 0 to 176
   goals met: 1 of 7
10. (turn_to satellite0 groundstation0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 112.252 to 108.138, (fuel-used) from 45.748 to 49.862
   goals met: 1 of 7
11. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 7
12. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
13. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 108.138 to 103.555, (fuel-used) from 49.862 to 54.445
   goals met: 1 of 7
14. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 103.555 to 98.972, (fuel-used) from 54.445 to 59.028
   goals met: 1 of 7
15. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 7
16. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 7
17. (switch_on instrument0 satellite0)
   deleted: (calibrated instrument0) (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
18. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 1 of 7
19. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
20. (turn_to satellite0 planet5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 98.972 to 94.389, (fuel-used) from 59.028 to 63.611
   goals met: 1 of 7
21. (turn_to satellite0 groundstation0 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 94.389 to 89.806, (fuel-used) from 63.611 to 68.194
   goals met: 1 of 7
22. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 7
23. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 7
24. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
25. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 7
26. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 89.806 to 57.676, (fuel-used) from 68.194 to 100.324
   goals met: 1 of 7
27. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   changed: (data_capacity satellite0) from 824 to 580, (data-stored) from 176 to 420
   goals met: 2 of 7
28. (turn_to satellite0 planet5 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 57.676 to 52.716, (fuel-used) from 100.324 to 105.284
   goals met: 2 of 7
29. (take_image satellite0 planet5 instrument0 spectrograph2)
   added: (have_image planet5 spectrograph2)
   changed: (data_capacity satellite0) from 580 to 405, (data-stored) from 420 to 595
   goals met: 3 of 7
30. (turn_to satellite0 star1 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star1)
   changed: (fuel satellite0) from 52.716 to 45.661, (fuel-used) from 105.284 to 112.339
   goals met: 3 of 7
31. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 45.661 to 36.685, (fuel-used) from 112.339 to 121.315
   goals met: 3 of 7
32. (take_image satellite0 star8 instrument0 spectrograph2)
   added: (have_image star8 spectrograph2)
   changed: (data_capacity satellite0) from 405 to 228, (data-stored) from 595 to 772
   goals met: 4 of 7
33. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 7
34. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 7
35. (turn_to satellite0 groundstation0 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 36.685 to 29.382, (fuel-used) from 121.315 to 128.618
   goals met: 4 of 7
36. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 4 of 7
37. (turn_to satellite0 planet10 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet10)
   changed: (fuel satellite0) from 29.382 to 25.268, (fuel-used) from 128.618 to 132.732
   goals met: 4 of 7
38. (turn_to satellite0 star3 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 25.268 to 23.805, (fuel-used) from 132.732 to 134.195
   goals met: 4 of 7
39. (take_image satellite0 star3 instrument1 image3)
   added: (have_image star3 image3)
   changed: (data_capacity satellite0) from 228 to 196, (data-stored) from 772 to 804
   goals met: 5 of 7
40. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   changed: (fuel satellite0) from 23.805 to 20.253, (fuel-used) from 134.195 to 137.747
   goals met: 5 of 7
41. (take_image satellite0 star4 instrument1 spectrograph1)
   added: (have_image star4 spectrograph1)
   changed: (data_capacity satellite0) from 196 to 154, (data-stored) from 804 to 846
   goals met: 6 of 7
42. (turn_to satellite0 star2 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 20.253 to 19.6277, (fuel-used) from 137.747 to 138.372
   goals met: 6 of 7
43. (turn_to satellite0 star8 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 19.6277 to 11.6677, (fuel-used) from 138.372 to 146.332
   goals met: 6 of 7
44. (turn_to satellite0 phenomenon9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 11.6677 to 0.9077, (fuel-used) from 146.332 to 157.092
   goals met: 6 of 7
45. (take_image satellite0 phenomenon9 instrument1 infrared0)
   added: (have_image phenomenon9 infrared0)
   changed: (data_capacity satellite0) from 154 to 1, (data-stored) from 846 to 999
   goals met: 7 of 7
